package core;
import commands.*;

import java.util.HashMap;
import java.util.Map;
import java.util.Scanner;

/**
 * Trida pro vytvareni a spousteni hry.
 * Slouzi k zpracovani hlavniho vstupu uzivatele a vytvoreni commandu.
 * Obsahuje hlavni smycku hry.
 * @author Matej Kesl
 */
public class Game {
    private Map<String, Command> commands;
    private Player player;
    private World world;
    private CreateWorld createWorld;

    public Game() {
        this.commands = new HashMap<>();
        this.player = new Player(3);
        this.world = new World();
        this.createWorld = new CreateWorld(world);
        //createWorld.saveWorld();
        world = createWorld.loadWorld("/world.json");
        registerCommands();
    }

    /**
     * Vytvori instance trid commandu a ulozi je do mapy.
     */
    public void registerCommands() {
        commands.put("go", new GoCommand(this.player, this.world));
        commands.put("take", new TakeCommand(this.world, this.player));
        commands.put("put", new PutCommand(this.world, this.player));
        commands.put("talk", new TalkCommand(this.player, this.world));
        commands.put("explore", new ExploreCommand(this.world, this.player));
        commands.put("backpack", new BackpackCommand(this.player, this.world));
        commands.put("help", new HelpCommand(this, this.world));
        commands.put("exit", new ExitCommand());
        commands.put("map", new MapCommand(this.world, this.player));
    }

    /**
     * Zpracovava hlavni vstup uzivatele a vola execute metodu daneho commandu.
     * @param key vstup uzivatele
     * @return int
     */
    public int startCommand(String key) {
        String[] parts = key.split("\\s+");

        Command command = commands.get(parts[0]);

        if (command == null) {
            System.out.println("Neplatný příkaz");
            return 1;
        }
        return command.execute(parts);
    }

    /**
     * Metoda s hlavnim loopem.
     * Vytiskne uvodni text.
     * @return int
     */
    public int run () {
        int running = 0;

        System.out.println("                                                                                                                                                      \n" +
                "                                                                                                                                                      \n" +
                "                                                                                                                                                      \n" +
                "                                                                                                                                                      \n" +
                "                                                            ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                            \n" +
                "                                                      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                      \n" +
                "                                                 ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                 \n" +
                "                                             ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                             \n" +
                "                                         ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑        ↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                         \n" +
                "                                      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑        ↑↑↑↑          ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                      \n" +
                "                                    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑               ↑↑↑↑        ↑↑↑↑               ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                    \n" +
                "                                 ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                   ↑↑↑↑        ↑↑↑↑                   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                 \n" +
                "                               ↑↑↑↑↑↑↑↑↑↑↑↑↑                       ↑↑↑↑        ↑↑↑↑                       ↑↑↑↑↑↑↑↑↑↑↑↑↑                               \n" +
                "                             ↑↑↑↑↑↑↑↑↑↑↑↑                          ↑↑↑↑        ↑↑↑↑                          ↑↑↑↑↑↑↑↑↑↑↑↑                             \n" +
                "                           ↑↑↑↑↑↑↑↑↑↑↑↑                            ↑↑↑↑        ↑↑↑↑                            ↑↑↑↑↑↑↑↑↑↑↑↑                           \n" +
                "                         ↑↑↑↑↑↑↑↑↑↑↑                               ↑↑↑↑        ↑↑↑↑                               ↑↑↑↑↑↑↑↑↑↑↑                         \n" +
                "                        ↑↑↑↑↑↑↑↑↑↑                                 ↑↑↑↑        ↑↑↑↑                                 ↑↑↑↑↑↑↑↑↑↑                        \n" +
                "                      ↑↑↑↑↑↑↑↑↑↑                                   ↑↑↑↑        ↑↑↑↑                                   ↑↑↑↑↑↑↑↑↑↑                      \n" +
                "                     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                     \n" +
                "                   ↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑                   \n" +
                "                  ↑↑↑↑↑↑↑↑↑   ↑↑↑↑                                                                                  ↑↑↑↑   ↑↑↑↑↑↑↑↑↑                  \n" +
                "                 ↑↑↑↑↑↑↑↑↑    ↑↑↑↑                                                                                  ↑↑↑↑    ↑↑↑↑↑↑↑↑↑                 \n" +
                "                ↑↑↑↑↑↑↑↑      ↑↑↑↑                                                                                  ↑↑↑↑      ↑↑↑↑↑↑↑↑                \n" +
                "               ↑↑↑↑↑↑↑↑       ↑↑↑↑                                                                                  ↑↑↑↑       ↑↑↑↑↑↑↑↑               \n" +
                "              ↑↑↑↑↑↑↑↑        ↑↑↑↑                                                                                  ↑↑↑↑        ↑↑↑↑↑↑↑↑              \n" +
                "             ↑↑↑↑↑↑↑↑         ↑↑↑↑                                                                                  ↑↑↑↑         ↑↑↑↑↑↑↑↑             \n" +
                "            ↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑            \n" +
                "            ↑↑↑↑↑↑↑           ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑            \n" +
                "           ↑↑↑↑↑↑↑↑         ↑↑↑↑↑↑↑↑↑                ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                 ↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑           \n" +
                "          ↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑         ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑          \n" +
                "          ↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑       ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑          \n" +
                "         ↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑         \n" +
                "         ↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑         \n" +
                "        ↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑         \n" +
                "        ↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑                      ↑↑↑↑↑↑↑        \n" +
                "        ↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑   ↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑                      ↑↑↑↑↑↑↑        \n" +
                "        ↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑           ↑↑↑↑↑↑↑↑↑↑↑                      ↑↑↑↑↑↑↑        \n" +
                "       ↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑         ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑↑↑                       ↑↑↑↑↑↑↑        \n" +
                "       ↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑             ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑       ↑↑↑↑↑↑↑↑↑↑↑↑↑                      ↑↑↑↑↑↑↑       \n" +
                "       ↑↑↑↑↑↑↑       ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑       \n" +
                "       ↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑         ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑           ↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑       \n" +
                "       ↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑       ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑  ↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑       \n" +
                "       ↑↑↑↑↑↑↑             ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑            ↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑       \n" +
                "       ↑↑↑↑↑↑↑                 ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑             ↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑           ↑↑↑↑↑↑↑       \n" +
                "       ↑↑↑↑↑↑↑                    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑            ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑       ↑↑↑↑↑↑↑           ↑↑↑↑↑↑↑       \n" +
                "        ↑↑↑↑↑↑↑             ↑        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑↑↑↑↑↑↑            ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑                         ↑↑↑↑↑↑↑        \n" +
                "        ↑↑↑↑↑↑↑            ↑↑↑↑↑       ↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑              ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑                         ↑↑↑↑↑↑↑        \n" +
                "        ↑↑↑↑↑↑↑           ↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑                 ↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑                         ↑↑↑↑↑↑↑        \n" +
                "        ↑↑↑↑↑↑↑↑         ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑                        ↑↑↑↑↑↑↑↑        \n" +
                "         ↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑↑↑↑                        ↑↑↑↑↑↑↑         \n" +
                "         ↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑                  ↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑                    ↑↑↑↑↑↑↑↑         \n" +
                "          ↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑              ↑↑↑↑              ↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                 ↑↑↑↑↑↑↑          \n" +
                "          ↑↑↑↑↑↑↑↑            ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑       ↑↑↑        ↑↑↑↑↑            ↑    ↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑             ↑↑↑↑↑↑↑↑          \n" +
                "           ↑↑↑↑↑↑↑↑                         ↑↑↑↑↑↑↑↑    ↑↑↑   ↑↑↑↑↑       ↑↑↑↑   ↑↑       ↑↑↑ ↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑          ↑↑↑↑↑↑↑↑           \n" +
                "            ↑↑↑↑↑↑↑                       ↑↑↑↑↑↑↑   ↑↑↑ ↑↑↑↑ ↑↑↑↑↑↑↑     ↑↑↑↑↑  ↑↑↑↑     ↑↑↑ ↑↑↑↑↑   ↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑         ↑↑↑↑↑↑↑↑            \n" +
                "            ↑↑↑↑↑↑↑↑                    ↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑       ↑↑ ↑↑↑ ↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑         ↑↑↑↑↑↑↑↑            \n" +
                "             ↑↑↑↑↑↑↑↑                 ↑↑↑↑↑↑   ↑↑↑   ↑↑↑↑ ↑↑↑↑↑↑       ↑↑↑↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑        ↑↑↑↑↑↑↑↑             \n" +
                "              ↑↑↑↑↑↑↑↑               ↑↑↑↑↑     ↑↑↑↑↑↑ ↑↑↑  ↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑↑  ↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑    ↑↑↑        ↑↑↑↑↑↑↑↑              \n" +
                "               ↑↑↑↑↑↑↑↑             ↑↑↑↑↑      ↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑    ↑↑ ↑  ↑↑↑↑↑     ↑       ↑↑↑↑↑↑↑↑               \n" +
                "                ↑↑↑↑↑↑↑↑↑         ↑↑↑↑↑  ↑↑↑↑↑  ↑↑↑↑ ↑↑  ↑↑↑↑↑↑↑↑↑                  ↑↑↑↑↑↑↑↑↑   ↑↑↑     ↑↑↑↑   ↑↑↑↑↑         ↑↑↑↑↑↑↑↑↑                \n" +
                "                 ↑↑↑↑↑↑↑↑↑       ↑↑↑↑↑  ↑↑↑↑↑↑↑  ↑↑↑  ↑↑↑↑↑↑↑                            ↑↑↑↑↑↑↑ ↑↑↑↑ ↑↑↑↑↑↑ ↑  ↑↑↑↑↑       ↑↑↑↑↑↑↑↑↑                 \n" +
                "                  ↑↑↑↑↑↑↑↑↑     ↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑                                  ↑↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑     ↑↑↑↑↑↑↑↑↑                  \n" +
                "                   ↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑ ↑↑↑↑↑↑                                      ↑↑↑↑↑↑ ↑ ↑↑↑↑↑↑     ↑↑↑↑↑  ↑↑↑↑↑↑↑↑↑↑                   \n" +
                "                     ↑↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑↑ ↑↑↑↑  ↑↑↑↑↑                                          ↑↑↑↑↑  ↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                     \n" +
                "                      ↑↑↑↑↑↑↑↑↑↑↑↑  ↑↑↑ ↑↑↑    ↑↑↑↑↑                                              ↑↑↑↑↑ ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                      \n" +
                "                        ↑↑↑↑↑↑↑↑↑↑  ↑↑↑↑↑↑↑   ↑↑↑↑↑                                                ↑↑↑↑↑ ↑↑↑↑↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑                        \n" +
                "                         ↑↑↑↑↑↑↑↑↑↑↑    ↑↑↑↑ ↑↑↑↑↑                                                  ↑↑↑↑↑  ↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑                          \n" +
                "                           ↑↑↑↑↑↑↑↑↑↑↑       ↑↑↑↑                                                    ↑↑↑↑  ↑↑   ↑↑↑↑↑↑↑↑↑↑↑                           \n" +
                "                             ↑↑↑↑↑↑↑↑↑↑↑↑   ↑↑↑↑                                                      ↑↑↑↑   ↑↑↑↑↑↑↑↑↑↑↑↑                             \n" +
                "                               ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                        ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                               \n" +
                "                                  ↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                       ↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                 \n" +
                "                                    ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                               ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                    \n" +
                "                                       ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                     ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                       \n" +
                "                                         ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                          \n" +
                "                                             ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                             \n" +
                "                                                 ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                 \n" +
                "                                                      ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                      \n" +
                "                                                               ↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑↑                                                            \n" +
                "                                                                                                                                                      \n" +
                "                                                                                                                                                      \n" +
                "                                                                                                                                                      \n" +
                "                                                                                                                                                      ");

        System.out.println("Vítej ve hře „Únik z Ječné“.\n" +
                "\n" +
                "Jsi student, který po skončení vyučování zůstal ve škole déle,\n" +
                "aby dokončil práci na projektu. Když se ale setmělo, škola se\n" +
                "uzamkla, světla zhasla a většina lidí už odešla.\n" +
                "\n" +
                "Teď jsi v budově sám.\n" +
                "Prozkoumávej místnosti, mluv s postavami a sbírej předměty,\n" +
                "které ti pomohou najít cestu ven.");
        System.out.println();
        System.out.println("CÍL HRY:\n" +
                "Tvým cílem je opustit školu hlavním vchodem.\n" +
                "\n" +
                "Aby se ti to podařilo, musíš:\n" +
                "> prozkoumávat školu a její místnosti,\n" +
                "> plnit úkoly pro ostatní postavy,\n" +
                "> získat potřebné itemy, kódy a hesla.\n" +
                "\n" +
                "Jakmile získáš potřebné itemy k otevření hlavnícho vchodu,\n" +
                "unikl jsi a vítězíš.");

        Command help = commands.get("help");
        help.execute(null);

        Scanner sc = new Scanner(System.in);

        //hlavni loop
        while (running!=9) {
            System.out.print("command id>");
            String input = sc.nextLine().toLowerCase();
            running = startCommand(input);
        }
        return endGame();
    }

    /**
     * Metoda pro vytisk pri konci hry.
     * @return int
     */
    public int endGame () {
        if (player.getHasWon()){
            System.out.println("Uspěšně jsi odemkl hlavní vchod!");
            System.out.println("----------------------------------------------------------------------------------------------------------------");
            System.out.println("Gratuluji, vyhrál jsi!");
            System.out.println("Konec hry.");
            return 0;
        } else {
            System.out.println("Hodně štěstí příště.");
            System.out.println("Konec hry.");
            return 9;
        }
    }

    //commandy
    public Map<String, Command> getCommands() {
        return commands;
    }

    //gettery pro testy
    public Player getPlayer() {
        return player;
    }
    public World getWorld() {
        return world;
    }
}